$(function () {
    var maincontent = [{
        "name": "沙发",
        "content": '<h3 class="art-tit">使用注意事项</h3>						<p class="art-txt">1. 沙发放置在平整的地面上，四脚底部最好垫放软垫，防止移动时损伤地板；</p>						<p class="art-txt">2. 使用前应用干净软棉布揩净沙发表面的尘迹，并经常保持清洁；</p>						<p class="art-txt">3. 避免儿童在沙发座面上跳动，以免局部受压后变形影响使用；</p>						<p class="art-txt">4. 不允许用有锐角或刀具类器具接触表面，防止划伤面料；</p>						<p class="art-txt">5. 避免阳光长时间照射沙发，以免造成产品局部褪色或泛色</p>						<div class="line mt40 mb40"></div>						<h3 class="art-tit">使用保养说明</h3>						<p class="art-txt">日常保养：使用干净的软棉布，经常性揩净面料尘迹或污迹。背、扶手与座面交接处缝隙可用吸尘器清洁杂物。禁止使用湿布、硬物或酸、碱性等化学物品接触面料，以免影响表面质量和使用周期</p>						<p class="art-txt mt40">定期保养：一般每季度保养一次。纺织面料清洗、保养应按标签所示要求洗涤，防止洗涤后面料缩水、变形。皮革为保持皮面的柔软和光泽，需要避免阳光的直接照射，并远离加热设备。皮革不可以使用下列清洗产品：皮革洗涤皂、洗涤剂、抛光剂、皮革油、皮革漆、腐蚀性洗涤剂等。</p>'
    }, {
        "name": "地毯",
        "content": '<h3 class="art-tit">使用保养说明</h3>						<p class="art-txt">1. 棉纤维：小尺寸的棉纤维地毯可以用温和的清洁剂直接在温水机洗。但是如果是大尺寸的地毯就需要使用专业的干洗粉来清洁。</p>						<p class="art-txt">2. 天然麻纤维：清洁麻纤维上的污垢时，尽量少用水来清洗。切记不可蒸汽清洁。可以将少量苏打水或温和的肥皂水用棉布擦拭即可。</p>						<p class="art-txt">3. 人造丝：尽量避免将这类材质的地毯铺于人流量较多的地域。因为这种纤维材质不适合较潮湿环境，也不能负荷太多。这需要专业的清洁打理或者用较干的布做局部处理。</p>						<p class="art-txt">4. 黄麻：请先用较干的棉布将污渍吸附一下，然后用水和纯醋一起擦洗污渍。但是切记清理污渍的抹布一定要拧干，因为过多的水分或湿气对保养黄麻地毯是非常不利的。</p>						<p class="art-txt">5. 羊毛：众所周知，羊毛地毯有略微的掉毛现象是非常正常的。在初期使用羊毛地毯的几个月内，每周至少需要吸尘器吸一次。关于清洁打理，可以使用羊毛清洗剂清理污渍，或者也可以使用一茶匙的白醋和1000毫升的温水混合自制清洁剂清理。在使用清洁剂前，请尽量将毯面上的水分吸附干净。</p>						<p class="art-txt">6. 晴纶：可以使用普通的清洁剂清理污渍，或者也可以用一茶匙的白醋和1000毫升的温水混合自制清洁剂清理。在使用清洁剂前，请尽量将毯面上的水分吸附干净。</p>						<p class="art-txt">7. 丙纶材质：丙纶是抗污能力最强的材质之一，尤其是防潮效果极佳。具体打理保养方法同羊毛材质。</p>						<p class="art-txt">8. 涤纶：涤纶材质同丙纶一样，也是抗污能力较强的材质之一；防潮效果极佳；具体打理保养方法同羊毛材质</p>'
    }, {
        "name": "木家具",
        "content": '	<h3 class="art-tit">使用注意事项</h3>						<p class="art-txt">1. 家具使用前保持15天～20天空置，适当保持空气流通，以消除家具表面涂料中的残留气味。</p>						<p class="art-txt">2. 平稳放置物品，较重的物品应放置在家具底部（层），以防止家具重心不稳倾倒。大衣柜顶部不宜放置重物，以免引起顶板下垂变形影响门开启。</p>						<p class="art-txt">3. 避免儿童贴近家具的玻璃、镜子、锐角等处。</p>						<p class="art-txt">4. 避免阳光长时间照射家具，以免造成局部变色或褪色。</p>						<p class="art-txt">5. 家具的门和抽屉开启应适当用力，严禁猛开猛关，造成结构等松动。</p>						<p class="art-txt">6. 不要将家具存放在潮湿的环境下，避开水浸和过热的情况，例如空调风口和暖气片旁边。</p>						<p class="art-txt">7. 不要将高温的饮料或食物直接放在家具上，需要垫上隔热垫。</p>						<div class="line mt40 mb40"></div>						<h3 class="art-tit">使用保养说明</h3>						<p class="art-txt">1. 日常保养时，切忌使用硬物抹擦家具表面和镜子。切忌让酸、碱性的化学物品接触到家具表面。建议使用柔软微湿的棉布清洁后，再使用干净软棉布擦拭一遍，以免水气残留在家具表面。</p>						<p class="art-txt">2. 定期保养：一般应每季度保养一次，用干净软棉布揩净家具表面尘迹，用家具专用的上光蜡均匀涂擦表面，稍后再用干净的软棉布擦亮，能使家具表面涂层持续光亮。</p>						<p class="art-txt">3. 门铰链和抽屉导轨等活动五金配件应定期适当加些专用润滑油。</p>						<p class="art-txt">4. 保持室内适当的温度和湿度，以免引起家具部件收缩、开裂、变形。</p>'
    }, {
        "name": "金属家具",
        "content": '<h3 class="art-tit">使用注意事项</h3>						<p class="art-txt">1. 家具放置在较为平整的地面上，柜类家具较重的物品应放置在家具底部（层），以免防止家具重心不稳倾倒。柜类家具顶部不宜放置重物，以免顶板变形影响门开启。</p>						<p class="art-txt">2. 避免儿童贴近家具的玻璃、锐角等部位。</p>						<p class="art-txt">3. 避免阳光长时间照射家具，以免造成局部褪色等。</p>						<p class="art-txt">4. 家具使用移动时，应轻放轻移，家具的门和抽屉启闭应适当轻开轻关，严禁猛开猛关，以免造成产品结构变形松动，影响使用。</p> <div class="line mt40 mb40"></div>	<h3 class="art-tit">使用保养说明</h3>						<p class="art-txt">1. 日常保养时，切忌使用硬物抹擦家具表面和镜子。切忌让酸、碱性的化学物品接触家具表面。应使用柔软的棉质湿布。</p><p class="art-txt">2. 定期保养：一般每季度保养一次，用干净软棉布揩净家具表面尘迹后，用家具专用的上光蜡均匀涂擦表面，稍后再用干净的软棉布擦亮，能使家具表面涂层持续光亮。</p><p class="art-txt">3. 门铰链和抽屉导轨等活动五金配件应定期适当加些专用润滑油。</p>				'
    }, {
        "name": "藤家具",
        "content": '<h3 class="art-tit">使用注意事项</h3>						<p class="art-txt">1. 避免阳光长时间直射、避免靠近火源，以防藤料退色、变干、变形、弯曲、开裂、松动和脱开,以及局部变色。</p>						<p class="art-txt">2. 不要将藤家具存放在潮湿的环境下，避开水浸和过热的情况，例如空调风口和暖气片傍边，以免藤条受潮或变干变脆或断裂。</p>						<div class="line mt40 mb40"></div>						<h3 class="art-tit">使用保养说明</h3>						<p class="art-txt">1. 清洁时可以用吸尘器先吸一遍，或者用软毛刷由里向外先将浮尘拂去，用微湿（不能太湿）的抹布抹一遍，然后用软棉布擦干净即可。</p>						<p class="art-txt">2. 使用一段时间后，可用淡盐水擦拭，既能去污又能使其柔韧性保持长久不衰，还有一定的防脆、防虫蛀的作用。</p>						<p class="art-txt">3. 清洁完毕须置于阴凉处自然晾干，切忌暴晒，以免引起油漆变色、干裂。</p>						<p class="art-txt">4. 不可用水冲洗，以免藤编制品过份受潮后容易变形。</p>'
    }, {
        "name": "软体床",
        "content": '<h3 class="art-tit">使用注意事项</h3>						<p class="art-txt">1. 使用前保持15天～20天空置，适当保持空气流通，以消除家具表面涂料中残留气味。</p>						<p class="art-txt">2. 放置在平整的地面上，四脚底部最好垫放软垫，防止移动时损伤地板。</p>						<p class="art-txt">3. 使用前应用干净软棉布揩净软体床表面的尘迹，并经常保持清洁。</p>						<p class="art-txt">4. 避免在床架上经常跳动，以免局部受压后变形影响使用。</p>						<p class="art-txt">5. 不允许用有锐角或刀具类器具接触表面，防止划伤包覆材料或部件油漆。</p>						<p class="art-txt">6. 避免阳光长时间照射，以免造成产品局部褪色或泛色。</p>						<div class="line mt40 mb40"></div>						<h3 class="art-tit">使用保养说明</h3>						<p class="art-txt">1. 日常保养：使用干净的软棉布擦揩净尘迹或污迹。交接处缝隙可用吸尘器清洁杂物。禁止使用湿布、硬物或酸、碱性等化学物品接触面料或油漆部件。</p>						<p class="art-txt">2. 定期保养：一般每季度保养一次。</p>						<p class="art-txt">3. 纺织面料清洗、保养应按标签所示要求洗涤，防止洗涤后面料缩水、变形。</p>						<p class="art-txt">4. 皮革面料为保持皮面柔软和光泽，需要避免阳光的直接照射，并远离加热设备。使用皮革面料不可以使用下列清洗产品：皮革洗涤皂、洗涤剂、抛光剂、皮革油、皮革漆、腐蚀性洗涤剂等。</p>'
    }, {
        "name": "弹簧软床垫",
        "content": '<h3 class="art-tit">使用保养说明</h3>						<p class="art-txt">1. 使用前应去掉塑料薄膜等外包装物。</p>						<p class="art-txt">2. 平放在平整的床铺面上，铺面上应垫软质垫物，使床垫均匀承托。</p>						<p class="art-txt">3. 使用时应避免在垫面上局部受力重压，以免造成床垫局部凹陷变形影响使用。</p>						<p class="art-txt">4. 使用时应避免使用锐角器具或刀具等划伤面料。</p>						<p class="art-txt">5. 使用时应保持干燥避免明火，损伤垫面。</p>						<p class="art-txt">6. 建议3～4个月左右，床垫应定期对调和翻身，能使垫面均匀受力，延长使用寿命。</p>'
    }, {
        "name": "乳胶床垫",
        "content": '<h3 class="art-tit">使用保养说明</h3>						<p class="art-txt">1. 使用前应去掉包装塑料薄膜以及全棉包装袋等外包装物。</p>						<p class="art-txt">2. 平放在平整的床铺面上，铺面上应垫软质垫物，使床垫均匀承托。</p>						<p class="art-txt">3. 使用时应避免在垫面上局部受力重压，以免造成床垫局部凹陷变形影响使用。</p>						<p class="art-txt">4. 使用时应避免使用锐角器具或刀具等划伤面料。</p>						<p class="art-txt">5. 使用时应保持干燥避免明火，损伤垫面。</p>						<p class="art-txt">6. 建议3～4个月左右，床垫应定期对调和翻身，能使垫面均匀受力，延长使用寿命。</p>						<p class="art-txt">7. 清洗时只需干洗含有羊毛成分的可拆卸的床垫外套；乳胶椰棕床垫芯部分基本不需清洗，如确有小面积脏污时，只需用湿毛巾擦拭后通风干燥即可使用。</p>						<p class="art-txt">8. 乳胶椰棕床垫芯部分不能日晒，使用一段时间后会与空气氧化，颜色渐渐变黄，这是正常现象，不需特别担忧。</p>'
    }]

    $(".art-tit").find("h4").html(maincontent[0].name);
    $(".faqs").html(maincontent[0].content);

    //产品保养页面内容样式控制
    function changeContent(i) {
        $(".maintenance-nav li").removeClass("active");
        $(".art-tit").find("h4").html(maincontent[i].name);
        $(".faqs").html(maincontent[i].content);
    }

    //产品保养页面单击改变相应内容
    $(".maintenance-nav li").click(function () {
        var i = $(this).index();
        changeContent(i);
        $(this).addClass("active");

    })
    //根据帮助中心首页进入的url参数显示相应内容
    function getUrl() {
        var url = location.search; //获取url中"?"符后的字串   
        if (url.indexOf("?") != -1) {
            var str = url.substr(1);
            strs = str.split("&");
            changeContent(str);
            $('.maintenance-nav li').eq(str).addClass("active");
        }
    }
    getUrl();
})